In [1]:
import pandas as pd
#import seaborn as sns

#%matplotlib inline

In [2]:
# Read in the titanic dataset as a pandas dataframe

my_df = pd.read_csv("/Users/rharihar/Desktop/SCUBA/GA_Class/Titanic.csv")

# Find out dimensions of the dataframe
my_df.shape

(891, 12)

In [3]:
my_df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

From this dataset, how many passengers were male ?

In [8]:
male_df = my_df[my_df["Sex"] == "male"]
male_df.shape

(577, 12)

From this dataset, how many passengers were female ?

In [5]:
female_df = my_df[my_df["Sex"] == "female"]
female_df.shape

(314, 12)

How many male passengers survived the sinking ? (0 = No, 1 = Yes)

In [7]:
male_df[male_df["Survived"] == 1].shape

(109, 12)

How many female passengers survived the sinking ?

In [9]:
female_df[female_df["Survived"] == 1].shape

(233, 12)

How many people above age 25 were in the ship at the time of sinking ?

In [10]:
my_df[my_df["Age"] > 25].shape

(413, 12)

How many females below age 50 survived the sinking ?

In [11]:
age_50_df = female_df[female_df["Age"] < 50]
age_50_df[age_50_df["Survived"] == 1].shape

(177, 12)

In [13]:
new_df = (female_df[(female_df["Age"] < 50) & (female_df["Survived"] == 1)]).shape
new_df

(177, 12)

How many people who travelled Pclass 1 survived ?

In [14]:
pclass_1_df = my_df[my_df["Pclass"] == 1]
pclass_1_df.shape

(216, 12)

In [15]:
pclass_1_df[pclass_1_df["Survived"] == 1].shape

(136, 12)

How many people who travelled Pclass 3 survived ?

In [16]:
pclass_3_df = my_df[my_df["Pclass"] == 3]
pclass_3_df.shape

(491, 12)

In [17]:
pclass_3_df[pclass_3_df["Survived"] == 1].shape

(119, 12)

Can you make a dataframe of all passengers sorted by their age ?

In [18]:
sorted_by_age = my_df.sort_values(by = "Age", inplace =  False)
sorted_by_age.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
803,804,1,3,"Thomas, Master. Assad Alexander",male,0.42,0,1,2625,8.5167,NaN,C
755,756,1,2,"Hamalainen, Master. Viljo",male,0.67,1,1,250649,14.5000,NaN,S
644,645,1,3,"Baclini, Miss. Eugenie",female,0.75,2,1,2666,19.2583,NaN,C
469,470,1,3,"Baclini, Miss. Helene Barbara",female,0.75,2,1,2666,19.2583,NaN,C
78,79,1,2,"Caldwell, Master. Alden Gates",male,0.83,0,2,248738,29.0000,NaN,S

How many people below age 20 survived the sinking ?

In [19]:
age_20_df = my_df[my_df["Age"] < 20]
age_20_df.shape

(164, 12)

In [20]:
age_20_df[age_20_df["Survived"] == 1].shape

(79, 12)